In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
#df = pd.read_excel("Retail.xlsx")

In [4]:
#df.to_csv("Retail_converted.csv")

In [5]:
df = pd.read_csv("Retail_converted.csv")

In [6]:
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
406859,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
406860,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
406861,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
406862,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
406863,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

## Part A – Data Understanding (10 Marks)

In [7]:
# # 1. Identify:

In [8]:
#  Total number of rows and columns
print(f"Total Rows are : ",df.shape[0])
print (f"Total Columns are : ", df.shape[1])

Total Rows are :  406864
Total Columns are :  8

In [9]:
# Data types of each colum
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406864 entries, 0 to 406863
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    406864 non-null  object
 1   StockCode    406864 non-null  object
 2   Description  406864 non-null  object
 3   Quantity     406864 non-null  int64
 4   InvoiceDate  406864 non-null  object
 5   UnitPrice    406864 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      406864 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 24.8+ MB

## Explain the meaning of:
o InvoiceNo - 
This is a unique computer generated number given to each invoice genrated 

o StockCode - 
This is a unique code given to each Item to track the stock of individual item 

o Quantity -
the amount of units available for each item

## 3. How many:

In [10]:
#  Unique customers? 
print(f"Total Number of Unique customers are : ",df["CustomerID"].unique().shape[0])

Total Number of Unique customers are :  4373

In [11]:
# Unique products?
print(f"Total Number of Unique Products are : ",df["StockCode"].unique().shape[0])

Total Number of Unique Products are :  3684

In [12]:
# Unique invoices?
print(f"Total Number of Unique Invoices are : ",df["InvoiceNo"].unique().shape[0])

Total Number of Unique Invoices are :  22225

In [13]:
# Countries ? 
print(f"Total Number of Unique Countries are : ",df["Country"].unique().shape[0])

Total Number of Unique Countries are :  37

## Part B – Data Cleaning (15 Marks)

### Perform the following:

In [14]:
# 1. Identify missing values in each column
nullval = df.isnull().sum()

In [15]:
for col in nullval.index:
    if nullval[col] == 0:
        continue
    else:
        print(f"{col} Column has {nullval[col]} null values")

CustomerID Column has 35 null values

# 2. Remove or treat:

In [16]:
# Null CustomerID
df = df.dropna()
df

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
...,...,...,...,...,...,...,...,...
406859,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,2011-12-09 12:50:00,0.85,12680.0,France
406860,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
406861,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
406862,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
406863,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France

In [17]:
# Negative Quantity or UnitPrice
negQ = df[df["Quantity"] < 0]
negQ.shape[0]

8905

In [18]:
df = df[df["Quantity"] > 0]
df.shape[0]

397924

In [19]:
df = df[df["UnitPrice"] > 0]
df.shape[0]

397884

# 3. Check for:

In [20]:
# Duplicate Invoices
print(f"This Dataset contains {df.duplicated("InvoiceNo").sum()} Duplicate Values")

This Dataset contains 379352 Duplicate Values

In [21]:
# Zero or negative Amount
nega = df[df["UnitPrice"] <= 0]
nega

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [22]:
# 4. Convert InvoiceDate into proper date format
df["InvoiceDate"]= pd.to_datetime(df["InvoiceDate"])

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 397884 entries, 0 to 406863
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397884 non-null  object
 1   StockCode    397884 non-null  object
 2   Description  397884 non-null  object
 3   Quantity     397884 non-null  int64
 4   InvoiceDate  397884 non-null  datetime64[ns]
 5   UnitPrice    397884 non-null  float64
 6   CustomerID   397884 non-null  float64
 7   Country      397884 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.3+ MB

## Part C – Descriptive Analytics (20 Marks)

# Answer the following:

# 1. Total:

In [24]:
#Sales (Sum of Amount)
df["TotalSales"] = df["Quantity"] * df["UnitPrice"]

In [25]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalSales
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [26]:
#  Quantity sold
QS = df["Quantity"].sum()
print(f"The total anmount of Quantity sold is : " ,QS)

The total anmount of Quantity sold is :  5167812

## 2. Top 10:

In [27]:
# Customer by Revenue 
top10 = df.groupby("CustomerID", as_index = False)["TotalSales"].sum()
top10_sorted = top10.sort_values(by = "TotalSales", ascending = False).reset_index(drop = True)
top10_sorted.head(10)

   CustomerID  TotalSales
0     14646.0   280206.02
1     18102.0   259657.30
2     17450.0   194550.79
3     16446.0   168472.50
4     14911.0   143825.06
5     12415.0   124914.53
6     14156.0   117379.63
7     17511.0    91062.38
8     16029.0    81024.84
9     12346.0    77183.60

In [28]:
top10_sorted.nlargest(10, columns = "TotalSales")

   CustomerID  TotalSales
0     14646.0   280206.02
1     18102.0   259657.30
2     17450.0   194550.79
3     16446.0   168472.50
4     14911.0   143825.06
5     12415.0   124914.53
6     14156.0   117379.63
7     17511.0    91062.38
8     16029.0    81024.84
9     12346.0    77183.60

In [29]:
# PRoduct by Revenue 
topP = df.groupby("StockCode", as_index = False)["TotalSales"].sum()
topP_sorted = topP.sort_values(by = "TotalSales", ascending = False).reset_index(drop = True)
topP_sorted.nlargest(10, columns = "TotalSales")

  StockCode  TotalSales
0     23843   168469.60
1     22423   142592.95
2    85123A   100603.50
3    85099B    85220.78
4     23166    81416.73
5      POST    77803.96
6     47566    68844.33
7     84879    56580.34
8         M    53779.93
9     23084    51346.20

In [30]:
# Countries by revenue
topC = df.groupby("Country", as_index = False)["TotalSales"].sum()
topC_sort = topC.sort_values(by = "TotalSales",ascending= False).reset_index(drop = True)
topC_sort.nlargest(10,"TotalSales")

          Country   TotalSales
0  United Kingdom  7308391.554
1     Netherlands   285446.340
2            EIRE   265545.900
3         Germany   228867.140
4          France   209024.050
5       Australia   138521.310
6           Spain    61577.110
7     Switzerland    56443.950
8         Belgium    41196.340
9          Sweden    38378.330

## 3. Monthly:

In [31]:
# sales Trend
df["Year"] = df["InvoiceDate"].dt.year

In [32]:
df["Month"] = df["InvoiceDate"].dt.month

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 397884 entries, 0 to 406863
Data columns (total 11 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397884 non-null  object
 1   StockCode    397884 non-null  object
 2   Description  397884 non-null  object
 3   Quantity     397884 non-null  int64
 4   InvoiceDate  397884 non-null  datetime64[ns]
 5   UnitPrice    397884 non-null  float64
 6   CustomerID   397884 non-null  float64
 7   Country      397884 non-null  object
 8   TotalSales   397884 non-null  float64
 9   Year         397884 non-null  int32
 10  Month        397884 non-null  int32
dtypes: datetime64[ns](1), float64(3), int32(2), int64(1), object(4)
memory usage: 33.4+ MB

In [34]:
monthly = df.groupby(["Year","Month"],as_index = False)["TotalSales"].sum()
monthly

    Year  Month   TotalSales
0   2010     12   572713.890
1   2011      1   569445.040
2   2011      2   447137.350
3   2011      3   595500.760
4   2011      4   469200.361
5   2011      5   678594.560
6   2011      6   661213.690
7   2011      7   600091.011
8   2011      8   645343.900
9   2011      9   952838.382
10  2011     10  1039318.790
11  2011     11  1161817.380
12  2011     12   518192.790

In [35]:
monthly.to_csv("Monthly.csv", index = False)

In [36]:
# Number of invoices

df['Month_Name'] = df['InvoiceDate'].dt.month_name()

monthly_invoice_count = (df.groupby(['Year', 'Month_Name'])['InvoiceNo'].nunique().reset_index(name='Invoice_Count')
)

In [37]:
monthly_invoice_count

    Year Month_Name  Invoice_Count
0   2010   December           1400
1   2011      April           1149
2   2011     August           1280
3   2011   December            778
4   2011   February            997
5   2011    January            987
6   2011       July           1331
7   2011       June           1393
8   2011      March           1321
9   2011        May           1555
10  2011   November           2657
11  2011    October           1929
12  2011  September           1755

# 4. Average:

In [38]:
# Order value per invoice
Invoice_AVG = df.groupby("InvoiceNo", as_index = False)["TotalSales"].mean()
Invoice_AVG_Sorted = Invoice_AVG.sort_values(by = "TotalSales", ascending = False).reset_index(drop = True)
Invoice_AVG_Sorted

      InvoiceNo     TotalSales
0        581483  168469.600000
1        541431   77183.600000
2        556444   38970.000000
3        551697    8142.750000
4        540815    5053.633333
...         ...            ...
18527    580916       0.701111
18528    542736       0.550000
18529    571309       0.456154
18530    567869       0.400000
18531    570554       0.380000

[18532 rows x 2 columns]

In [39]:
# Items per invoice
Item_AVG = df.groupby("StockCode", as_index = False)["TotalSales"].mean()
Item_AVG_Sorted = Item_AVG.sort_values(by = "TotalSales", ascending = False).reset_index(drop = True)
Item_AVG_Sorted

     StockCode   TotalSales
0        23843  168469.6000
1       47556B    3022.5000
2          DOT     744.1475
3        22833     625.8825
4        21897     625.4100
...        ...          ...
3660    47013A       0.7600
3661     84990       0.5500
3662     84227       0.4200
3663    81953B       0.4180
3664      PADS       0.0010

[3665 rows x 2 columns]

# Part D – Customer Analysis (RFM) (20 Marks)

# Using CustomerID:
## 1. Compute:

## Recency

In [40]:

reference_date = df['InvoiceDate'].max() + pd.Timedelta(days=30)

In [41]:
recency_df = (
    df.groupby('CustomerID')['InvoiceDate']
      .max()
      .reset_index()
)

recency_df['Recency'] = (reference_date - recency_df['InvoiceDate']).dt.days

In [42]:
recency_df[['CustomerID', 'Recency']].sort_values( by = "Recency")

      CustomerID  Recency
3662     17364.0       30
71       12433.0       30
934      13599.0       30
892      13536.0       30
3366     16933.0       30
...          ...      ...
4108     17968.0      403
1037     13747.0      403
4064     17908.0      403
4180     18074.0      403
3103     16583.0      403

[4338 rows x 2 columns]

In [43]:
bins = [0,30,60,90,float('inf')]
labels = ["Very active customer", "Active","at risk","Inactive"]

In [44]:
recency_df["Recency Segmenation"] = pd.cut(recency_df['Recency'],
    bins=bins,
    labels=labels,
    right=True)

In [45]:
recency_df

      CustomerID         InvoiceDate  Recency Recency Segmenation
0        12346.0 2011-01-18 10:01:00      355            Inactive
1        12347.0 2011-12-07 15:52:00       31              Active
2        12348.0 2011-09-25 13:13:00      104            Inactive
3        12349.0 2011-11-21 09:51:00       48              Active
4        12350.0 2011-02-02 16:01:00      339            Inactive
...          ...                 ...      ...                 ...
4333     18280.0 2011-03-07 09:52:00      307            Inactive
4334     18281.0 2011-06-12 10:53:00      210            Inactive
4335     18282.0 2011-12-02 11:43:00       37              Active
4336     18283.0 2011-12-06 12:02:00       33              Active
4337     18287.0 2011-10-28 09:29:00       72             at risk

[4338 rows x 4 columns]

In [46]:
#segment_counts = recency_df['Recency Segmenation'].value_counts()

# plt.figure(figsize=(8,5))
# # plt.bar(segment_counts.index, segment_counts.values)

# # plt.xlabel("Recency Segmentation")
# # plt.ylabel("Number of Customers")
# # plt.title("Customer Distribution by Recency Segment")
# # plt.xticks(rotation=45)
# # plt.tight_layout()
# # plt.show()

## Recency based on Each Customer Average Days gap between purchase

In [47]:
df = df.sort_values(['CustomerID', 'InvoiceDate'])

In [48]:
df['Days_Between_Purchases'] = (df.groupby("CustomerID")["InvoiceDate"].diff().dt.days)

In [49]:
avg_gap_per_customer = df.groupby("CustomerID")["Days_Between_Purchases"].mean().reset_index(name='Avg_Days_Between_Purchases')

In [50]:
df = df.merge(avg_gap_per_customer,on='CustomerID',how='left')

In [51]:
overall_avg_days = avg_gap_per_customer['Avg_Days_Between_Purchases'].mean()

In [52]:
avg_gap_per_customer['Avg_Days_Between_Purchases'] = (
    avg_gap_per_customer['Avg_Days_Between_Purchases'].fillna(0)
)

In [53]:
print(f"Average days between purchases across all customers: {overall_avg_days:.2f} days")

Average days between purchases across all customers: 3.26 days

# Frequency (No. of invoices)

In [54]:
Customer_frequency = df.groupby("CustomerID", as_index = False)["InvoiceNo"].nunique().sort_values(by = "InvoiceNo", ascending = False).reset_index(drop = True)

In [55]:
Customer_frequency

      CustomerID  InvoiceNo
0        12748.0        209
1        14911.0        201
2        17841.0        124
3        13089.0         97
4        14606.0         93
...          ...        ...
4333     18213.0          1
4334     18215.0          1
4335     18269.0          1
4336     18274.0          1
4337     18240.0          1

[4338 rows x 2 columns]

# Monetary (Total Amount spent)

In [56]:
Customer_Monetary = df.groupby("CustomerID", as_index = False)["TotalSales"].sum().sort_values(by = "TotalSales", ascending = False).reset_index(drop = True)
Customer_Monetary

      CustomerID  TotalSales
0        14646.0   280206.02
1        18102.0   259657.30
2        17450.0   194550.79
3        16446.0   168472.50
4        14911.0   143825.06
...          ...         ...
4333     16878.0       13.30
4334     17956.0       12.75
4335     16454.0        6.90
4336     14792.0        6.20
4337     16738.0        3.75

[4338 rows x 2 columns]

## 2. Segment customers into:
### High Value
### Medium Value
### Low Value

In [57]:
bins2 = [0,1000,5000,float('inf')]
labels2 = ["Low Value","Mid Value","high Value"]

In [58]:
Customer_Monetary["Value Type"] = pd.cut(Customer_Monetary["TotalSales"], bins = bins2, labels = labels2, right = True)
Customer_Monetary

      CustomerID  TotalSales  Value Type
0        14646.0   280206.02  high Value
1        18102.0   259657.30  high Value
2        17450.0   194550.79  high Value
3        16446.0   168472.50  high Value
4        14911.0   143825.06  high Value
...          ...         ...         ...
4333     16878.0       13.30   Low Value
4334     17956.0       12.75   Low Value
4335     16454.0        6.90   Low Value
4336     14792.0        6.20   Low Value
4337     16738.0        3.75   Low Value

[4338 rows x 3 columns]

## 3. Identify:

# Top 5 loyal customers

In [59]:
# Top 5 loyal Customers based on recency and Sales

loyal = recency_df[recency_df["Recency Segmenation"] == "Very active customer"]

In [60]:
loyal_sort = loyal.sort_values(by = "Recency").reset_index(drop = True)

In [61]:
loyal_sort

    CustomerID         InvoiceDate  Recency   Recency Segmenation
0      12423.0 2011-12-09 10:10:00       30  Very active customer
1      12433.0 2011-12-09 10:02:00       30  Very active customer
2      12518.0 2011-12-09 10:13:00       30  Very active customer
3      12526.0 2011-12-09 12:09:00       30  Very active customer
4      12662.0 2011-12-09 11:59:00       30  Very active customer
..         ...                 ...      ...                   ...
88     17675.0 2011-12-08 18:03:00       30  Very active customer
89     17754.0 2011-12-09 11:20:00       30  Very active customer
90     17757.0 2011-12-08 15:31:00       30  Very active customer
91     17949.0 2011-12-08 18:46:00       30  Very active customer
92     18102.0 2011-12-09 11:50:00       30  Very active customer

[93 rows x 4 columns]

In [62]:
merged_df = pd.merge(Customer_Monetary, loyal_sort, on='CustomerID', how='inner')

In [63]:
merged_df =  pd.merge(merged_df,Customer_frequency, on='CustomerID', how='inner')

In [64]:
merged_df.rename(columns={'InvoiceNo': 'Frequency'}, inplace=True)
merged_df.rename(columns={'InvoiceNoRecency Segmenation': 'Recency Segmentation'}, inplace=True)

In [65]:
merged_df

,CustomerID,TotalSales,Value Type,InvoiceDate,Recency,Recency Segmenation,Frequency
0,18102.0,259657.30,high Value,2011-12-09 11:50:00,30,Very active customer,60
1,16446.0,168472.50,high Value,2011-12-09 09:15:00,30,Very active customer,2
2,14911.0,143825.06,high Value,2011-12-08 15:54:00,30,Very active customer,201
3,15311.0,60767.90,high Value,2011-12-09 12:00:00,30,Very active customer,91
4,17949.0,58510.48,high Value,2011-12-08 18:46:00,30,Very active customer,45
...,...,...,...,...,...,...,...
88,13298.0,360.00,Low Value,2011-12-08 13:11:00,30,Very active customer,1
89,17668.0,347.75,Low Value,2011-12-08 13:25:00,30,Very active customer,2
90,16322.0,326.75,Low Value,2011-12-08 15:41:00,30,Very active customer,2
91,13404.0,252.49,Low Value,2011-12-08 15:37:00,30,Very active customer,2
92,14569.0,227.39,Low Value,2011-12-08 14:58:00,30,Very active customer,1

In [77]:
merged_df[['CustomerID','TotalSales','Recency',"Frequency","Recency Segmenation"]].nlargest(5,"TotalSales")

   CustomerID  TotalSales  Recency  Frequency   Recency Segmenation
0     18102.0   259657.30       30         60  Very active customer
1     16446.0   168472.50       30          2  Very active customer
2     14911.0   143825.06       30        201  Very active customer
3     15311.0    60767.90       30         91  Very active customer
4     17949.0    58510.48       30         45  Very active customer

In [67]:
## Top 5 recency based loyal customers
loyal_rec = recency_df[['CustomerID', 'Recency']].sort_values( by = "Recency")

In [68]:
loyal_rec.nsmallest(5,"Recency")

      CustomerID  Recency
3662     17364.0       30
71       12433.0       30
934      13599.0       30
892      13536.0       30
3366     16933.0       30

# Customers at risk of churn

In [69]:
risk = recency_df[recency_df["Recency Segmenation"] == "at risk"]
risk

      CustomerID         InvoiceDate  Recency Recency Segmenation
5        12352.0 2011-11-03 14:37:00       65             at risk
10       12357.0 2011-11-06 16:07:00       62             at risk
12       12359.0 2011-10-13 12:47:00       87             at risk
13       12360.0 2011-10-18 15:22:00       81             at risk
20       12370.0 2011-10-19 14:51:00       80             at risk
...          ...                 ...      ...                 ...
4320     18261.0 2011-10-27 15:36:00       72             at risk
4326     18270.0 2011-11-01 13:57:00       67             at risk
4330     18276.0 2011-10-27 10:54:00       73             at risk
4331     18277.0 2011-10-12 15:22:00       87             at risk
4337     18287.0 2011-10-28 09:29:00       72             at risk

[728 rows x 4 columns]

In [70]:
# risk['CustomerID'].tolist()

## Part E – Diagnostic Analysis (15 Marks)

### Why do some customers have very high Recency?

In [71]:
dig_cust = pd.merge(df,recency_df[["CustomerID","Recency","Recency Segmenation"]], on = "CustomerID",how = "inner")
dig_cust

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,TotalSales,Year,Month,Month_Name,Days_Between_Purchases,Avg_Days_Between_Purchases,Recency,Recency Segmenation
0,541431,23166,MEDIUM CERAMIC TOP STORAGE JAR,74215,2011-01-18 10:01:00,1.04,12346.0,United Kingdom,77183.60,2011,1,January,NaN,NaN,355,Inactive
1,537626,85116,BLACK CANDELABRA T-LIGHT HOLDER,12,2010-12-07 14:57:00,2.10,12347.0,Iceland,25.20,2010,12,December,NaN,2.000000,31,Active
2,537626,22375,AIRLINE BAG VINTAGE JET SET BROWN,4,2010-12-07 14:57:00,4.25,12347.0,Iceland,17.00,2010,12,December,0.0,2.000000,31,Active
3,537626,71477,COLOUR GLASS. STAR T-LIGHT HOLDER,12,2010-12-07 14:57:00,3.25,12347.0,Iceland,39.00,2010,12,December,0.0,2.000000,31,Active
4,537626,22492,MINI PAINT SET VINTAGE,36,2010-12-07 14:57:00,0.65,12347.0,Iceland,23.40,2010,12,December,0.0,2.000000,31,Active
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397879,570715,22419,LIPSTICK PEN RED,12,2011-10-12 10:23:00,0.42,18287.0,United Kingdom,5.04,2011,10,October,0.0,2.275362,72,at risk
397880,570715,22866,HAND WARMER SCOTTY DOG DESIGN,12,2011-10-12 10:23:00,2.10,18287.0,United Kingdom,25.20,2011,10,October,0.0,2.275362,72,at risk
397881,573167,23264,SET OF 3 WOODEN SLEIGH DECORATIONS,36,2011-10-28 09:29:00,1.25,18287.0,United Kingdom,45.00,2011,10,October,15.0,2.275362,72,at risk
397882,573167,21824,PAINTED METAL STAR WITH HOLLY BELLS,48,2011-10-28 09:29:00,0.39,18287.0,United Kingdom,18.72,2011,10,October,0.0,2.275362,72,at risk
397883,573167,21014,SWISS CHALET TREE DECORATION,24,2011-10-28 09:29:00,0.29,18287.0,United Kingdom,6.96,2011,10,October,0.0,2.275362,72,at risk

In [72]:
#dig_cust.to_csv("Final_cleaned_File.csv")

In [73]:
merged_df.to_csv("RFM_segmentation.csv")

In [74]:
#dig_cust.to_excel("Final_excel.xlsx")

In [75]:
Customer_Monetary.to_csv("valuefile.csv")

In [81]:
RFM = merged_df[['CustomerID', 'TotalSales', 'Recency', 'Frequency', 'Recency Segmenation']].rename(columns={'TotalSales': 'Monetary'})

In [82]:
RFM

    CustomerID   Monetary  Recency  Frequency   Recency Segmenation
0      18102.0  259657.30       30         60  Very active customer
1      16446.0  168472.50       30          2  Very active customer
2      14911.0  143825.06       30        201  Very active customer
3      15311.0   60767.90       30         91  Very active customer
4      17949.0   58510.48       30         45  Very active customer
..         ...        ...      ...        ...                   ...
88     13298.0     360.00       30          1  Very active customer
89     17668.0     347.75       30          2  Very active customer
90     16322.0     326.75       30          2  Very active customer
91     13404.0     252.49       30          2  Very active customer
92     14569.0     227.39       30          1  Very active customer

[93 rows x 5 columns]

In [83]:
RFM.to_csv("RFMM.csv")

In [84]:
returned = pd.read_csv("Retail_converted.csv")

In [86]:
returned = returned[returned["Quantity"] < 0]

In [88]:
returned.to_csv("returned.csv")